window.onload = function() {
//曜日ごとのコメント
const schedule = {
    月曜日: "村中＠ＧＰＴです。\nT１２は良いのではないでしょうか。\nもう少し何とか丁寧な字を書けないものでしょうかね。\n村中の講義では字が汚いことは認識していますが、流れや勢いが削がれるよりは、良いと思っています。\nそういう状況ではないので、もう少し次回から丁寧に。\nでは、",
    火曜日: "村中＠ＧＰＴです。\nT１２は良いのではないでしょうか。\n考察は完璧です。提出してＴＡの判断を仰ぎましょう。\nでは、",
    水曜日: "村中＠ＧＰＴです。\nT１２は良いのではないでしょうか。\nちょっと短いかと思いますが、判断はＴＡにお任せです。\nでは、",
    木曜日: "村中＠ＧＰＴです。\nT１２は良いのではないでしょうか。\n実験レポートは期限ギリギリにやって合格できると思わないでください。\nＴＡとの勝負はそんなに甘くないです。\nでは、",
    金曜日: "村中＠ＧＰＴです。\nT１２あ良いのであないでしょうか。\n実験レポートを早く仕上げようとする気持ちを忘れずに最後までやり切ってください。\n単位取得できることを祈っています。\nであ、",
    土曜日: "村中＠ＧＰＴです。\nT１２は良いのではないでしょうか。\n実験レポートは早く完成させるに越したことはありません。余裕を持って質の高いレポートを作れるように頑張ってください。\nでは、",
    日曜日: "村中＠ＧＰＴです。\nT１２は良いのではないでしょうか。\n他の班員と生データが違ったり、計算ミスが明らかになったりしなかったら、合格になります。\nでは、"
};

//現実世界の曜日を読み取る
const daysOfWeek = ["日曜日", "月曜日", "火曜日", "水曜日", "木曜日", "金曜日", "土曜日"];
const currentDay = daysOfWeek[new Date().getDay()];

//現実世界の曜日に合わせてコメントを対応
const message = schedule[currentDay] || "対応していません";

console.log(`今日は ${currentDay}.`);
console.log(`評価: ${message}`);

//村中メッセージの要素を取得
const div = document.getElementById("muranaka_message")

//テキスト内容を設定
div.textContent = `評価: ${message}`;
}
